# Estatística para Machine Learning

## 2. Dados absolutos e relativos

- Dados Absolutos: Coleta direta da fonte sem nenhum outro tipo de manipulação (somente contagem, ordenação).
- Dados Relativos: Fácil entendimento para ajudar nas comparações.

In [1]:
import pandas as pd

### Percentuais

In [10]:
dados = {'emprego': ['Administrador_banco_de_dados', 'Programador', 'Arquiteto_redes'],
        'nova_jersey': [97350, 82080, 112840],
         'florida': [77140, 71540, 62310]}

In [11]:
type(dados)

dict

In [12]:
dados

{'emprego': ['Administrador_banco_de_dados', 'Programador', 'Arquiteto_redes'],
 'nova_jersey': [97350, 82080, 112840],
 'florida': [77140, 71540, 62310]}

In [13]:
dataset = pd.DataFrame(dados)

In [14]:
dataset

                        emprego  nova_jersey  florida
0  Administrador_banco_de_dados        97350    77140
1                   Programador        82080    71540
2               Arquiteto_redes       112840    62310

In [15]:
dataset['nova_jersey'].sum()

292270

In [16]:
dataset['florida'].sum()

210990

In [18]:
dataset['%_nova_jersey'] = (dataset['nova_jersey'] / dataset['nova_jersey'].sum()) * 100

In [19]:
dataset

                        emprego  nova_jersey  florida  %_nova_jersey
0  Administrador_banco_de_dados        97350    77140      33.308242
1                   Programador        82080    71540      28.083621
2               Arquiteto_redes       112840    62310      38.608136

In [20]:
dataset['%_florida'] = (dataset['florida'] / dataset['florida'].sum()) * 100

In [21]:
dataset

,emprego,nova_jersey,florida,%_nova_jersey,%_florida
0,Administrador_banco_de_dados,97350,77140,33.308242,36.560974
1,Programador,82080,71540,28.083621,33.906820
2,Arquiteto_redes,112840,62310,38.608136,29.532205

## Exercícios

### Exercício 1 - Percentual

In [28]:
dataset = pd.read_csv('census.csv')

In [29]:
dataset.head()

,age,workclass,final-weight,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loos,hour-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [30]:
dataset2 = dataset[['income', 'education']]

In [31]:
dataset2

       income    education
0       <=50K    Bachelors
1       <=50K    Bachelors
2       <=50K      HS-grad
3       <=50K         11th
4       <=50K    Bachelors
...       ...          ...
32556   <=50K   Assoc-acdm
32557    >50K      HS-grad
32558   <=50K      HS-grad
32559   <=50K      HS-grad
32560    >50K      HS-grad

[32561 rows x 2 columns]

In [32]:
dataset3 = dataset2.groupby(['education', 'income'])['education'].count()

In [33]:
dataset3

education      income
 10th           <=50K     871
                >50K       62
 11th           <=50K    1115
                >50K       60
 12th           <=50K     400
                >50K       33
 1st-4th        <=50K     162
                >50K        6
 5th-6th        <=50K     317
                >50K       16
 7th-8th        <=50K     606
                >50K       40
 9th            <=50K     487
                >50K       27
 Assoc-acdm     <=50K     802
                >50K      265
 Assoc-voc      <=50K    1021
                >50K      361
 Bachelors      <=50K    3134
                >50K     2221
 Doctorate      <=50K     107
                >50K      306
 HS-grad        <=50K    8826
                >50K     1675
 Masters        <=50K     764
                >50K      959
 Preschool      <=50K      51
 Prof-school    <=50K     153
                >50K      423
 Some-college   <=50K    5904
                >50K     1387
Name: education, dtype: int64

In [34]:
dataset3.index

MultiIndex([(        ' 10th', ' <=50K'),
            (        ' 10th',  ' >50K'),
            (        ' 11th', ' <=50K'),
            (        ' 11th',  ' >50K'),
            (        ' 12th', ' <=50K'),
            (        ' 12th',  ' >50K'),
            (     ' 1st-4th', ' <=50K'),
            (     ' 1st-4th',  ' >50K'),
            (     ' 5th-6th', ' <=50K'),
            (     ' 5th-6th',  ' >50K'),
            (     ' 7th-8th', ' <=50K'),
            (     ' 7th-8th',  ' >50K'),
            (         ' 9th', ' <=50K'),
            (         ' 9th',  ' >50K'),
            (  ' Assoc-acdm', ' <=50K'),
            (  ' Assoc-acdm',  ' >50K'),
            (   ' Assoc-voc', ' <=50K'),
            (   ' Assoc-voc',  ' >50K'),
            (   ' Bachelors', ' <=50K'),
            (   ' Bachelors',  ' >50K'),
            (   ' Doctorate', ' <=50K'),
            (   ' Doctorate',  ' >50K'),
            (     ' HS-grad', ' <=50K'),
            (     ' HS-grad',  ' >50K'),
            (     ' Masters', ' <=50K'),
            (     ' Masters',  ' >50K'),
            (   ' Preschool', ' <=50K'),
            ( ' Prof-school', ' <=50K'),
            ( ' Prof-school',  ' >50K'),
            (' Some-college', ' <=50K'),
            (' Some-college',  ' >50K')],
           names=['education', 'income'])

In [35]:
dataset3[' Bachelors', ' <=50K'], dataset3[' Bachelors', ' >50K']

(3134, 2221)

In [36]:
3134 + 2221

5355

In [37]:
# % >50K
(2221 / 5355) * 100

41.47525676937442

In [38]:
# % <=50K
(3134 / 5355) * 100

58.52474323062559

### Exercício 2 - coeficientes e taxas

In [39]:
dados = {'ano': ['1', '2', '3', '4', 'total'],
        'matriculas_marco': [70, 50, 47, 23, 190],
        'matriculas_novembro': [65, 48, 40, 22, 175]}

In [40]:
dados

{'ano': ['1', '2', '3', '4', 'total'],
 'matriculas_marco': [70, 50, 47, 23, 190],
 'matriculas_novembro': [65, 48, 40, 22, 175]}

In [41]:
dataset = pd.DataFrame(dados)
dataset

     ano  matriculas_marco  matriculas_novembro
0      1                70                   65
1      2                50                   48
2      3                47                   40
3      4                23                   22
4  total               190                  175

In [43]:
dataset['taxa_evasao'] = ((dataset['matriculas_marco'] - dataset['matriculas_novembro']) / dataset['matriculas_marco']) * 100

In [44]:
dataset

     ano  matriculas_marco  matriculas_novembro  taxa_evasao
0      1                70                   65     7.142857
1      2                50                   48     4.000000
2      3                47                   40    14.893617
3      4                23                   22     4.347826
4  total               190                  175     7.894737